Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType.ChamferMarkPropertyElementTypes Class
 The ChamferMarkPropertyElementTypes class represents the available property element types for chamfer marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PropertyElement.PropertyElementType.ChamferMarkPropertyElementTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class ChamferMarkPropertyElementTypes
<SerializableAttribute>
Public NotInheritable Class ChamferMarkPropertyElementTypes
The PropertyElement.PropertyElementType.ChamferMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
DX
Returns the change in the X direction property element type.
DY
Returns the change in the Y direction property element type.
Length
Returns the length property element type.
Name
Returns the name property element type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace